/**************************************************/
/*             HW#1 : 포인터 실습               */
/*  작성자 : 차현아        날짜 : 2021년 3월 19일 */
/*                                                */
/* 문제 정의 : 2차원 배열과 포인터                  */
/*************************************************/
#include<iostream>
using namespace std;
int main(void)
{
	int M[3][3] = { {1,2,3},{4,5,6},{7,8,9} };

	int(*ptr)[3]; // 배열포인터
	int* p; // 포인터
	int** pt; //이중포인터

	ptr = M; // 배열포인터가 M을 가리키게함.

	cout.width(30);
	cout << "< ptr=M >" << "\n" << "\n";
	cout << "ptr : " << ptr;// 포인터가 가리키는 곳(=M)의 주소 
	cout.width(30);
	cout << "M : " << M << "\n"; // 배열의 이름= 첫번째 원소의 주소값
	cout << "ptr+1 : " << ptr + 1; // = M+1 == M[1] == &M[1](주소값)
	cout.width(30);
	cout << "M+1 : " << M + 1 << "\n"; // == &M[0]+12(4*3) == &M[1] = M[1][0]의 주소값 
	cout << "*(ptr+1) : " << *(ptr + 1); //== *(M+1) == &M[1][0] (주소값)
	cout.width(30);
	cout << "*(M+1) : " << *(M + 1) << "\n"; //M[1](주소값)
	cout << "**(ptr+1) : " << **(ptr + 1); // *M[1]== M[1][0] (데이터값)
	cout.width(36);
	cout << "**(M+1) : " << **(M + 1); // *M[1] == M[1][0](데이터값)
	cout.width(20);
	cout.width(20);
	cout << "*M[1] : " << *M[1]; // 데이터값
	cout.width(20);
	cout << "M[1][0] : " << M[1][0] << "\n";
	cout << "ptr[1] : " << ptr[1]; // == M[1](주소값)
	cout.width(30);
	cout << "M[1] : " << M[1] << "\n" << "\n"; // = M+1 == M[1] == &M[1](주소값)

	p = M[0]; // 포인터가 배열 M의 1행(1차원 배열)을 가리키게함. 

	cout.width(30);
	cout << "< p = M[0] >" << "\n" << "\n";
	cout << "p :" << p; //== M[0] (주소값)
	cout.width(25);
	cout << "M[0]:" << M[0];
	cout.width(25);
	cout << "*M : " << *M << "\n"; // =M[0](주소값)
	cout << "p+1 :" << p + 1; //M[0][1]의 주소
	cout.width(25);
	cout << "M[0]+1:" << M[0] + 1; // == M[0][1]의 주소 == M[0] + 4바이트 
	cout.width(25);
	cout << "*M+1 : " << *M + 1 << "\n"; //*M=M[0] -> M[0]+1 == M[0][1]의 주소
	cout << "*(p+1) :" << *(p + 1); //*(M[0]+1)== M[0][1]
	cout.width(32);
	cout << "*(M[0]+1):" << *(M[0] + 1); // ==  M[0][1]
	cout.width(32);
	cout << "*(*M+1) : " << *(*M + 1) << "\n" << "\n"; //*M=M[0] -> *(M[0]+1)

	pt = &p;
	cout.width(30);
	cout << "< pt = &p >" << "\n";
	cout << "*pt =" << *pt; //이중포인터 pt가 가리키는 곳의 값
	cout.width(25);
	cout << "p =" << p << "\n"; // 포인터 p의 값
	cout << "**pt =" << **pt; //(*pt)=(p)가 가리키는 곳의 값
	cout.width(32);
	cout << "*p =" << *p; //p가 가리키는 곳의 값
}